docs: README流程图改用mermaid绘制
